Question

Two list were given and perform the following tasks

[2, 4, 6, 8, 10]
 
[8, 10, 12, 14, 16]
 
1. initialise a dataframe with above two list as separate columns
 
2. implement logic to add new column in dataframe which has values present in first column but not in second column
 
3. replace all 'NAN' with -1
 
4. drop the last row in data frame

Soluions

1. initialise a dataframe with above two list as separate columns

In [1]:
import pandas as pd

a = [2, 4, 6, 8, 10]
b = [8, 10, 12, 14, 16] 

d = {
        'a' : a,
        'b' : b
    }

df = pd.DataFrame(data=d, index=[1,2,3,4,5])

df

    a   b
1   2   8
2   4  10
3   6  12
4   8  14
5  10  16

2. implement logic to add new column in dataframe which has values present in first column but not in second column

In [2]:
df['c'] = [i if i not in b else "NAN" for i in a]

df

    a   b    c
1   2   8    2
2   4  10    4
3   6  12    6
4   8  14  NAN
5  10  16  NAN

3. replace all 'NAN' with -1

In [3]:
df = df.replace("NAN", -1)

df

    a   b  c
1   2   8  2
2   4  10  4
3   6  12  6
4   8  14 -1
5  10  16 -1

4. drop the last row in data frame

In [4]:
df = df.drop(index=5)

df

   a   b  c
1  2   8  2
2  4  10  4
3  6  12  6
4  8  14 -1